##### SQL is part of term 1: we will be focussing on the key notes

```
SELECT col1 + col2 as sum
FROM the_table
WHERE col3 = 'US';
```

##### Quiz Arithmatic Operation

```
SELECT id, account_id, standard_amt_usd/standard_qty as unit_price
FROM table
LIMIT 10;
```

##### LIKE

```
SELECT * 
FROM table
WHERE col1 LIKE '%google%'

```
To Search col1 (text column) with a word google in it

##### IN

```
SELECT *
FROM table
WHERE col1 in (1001,1021)
```

##### NOT

```
SELECT *
FROM table
WHERE col1 NOT LIKE '%google%'
```

```
SELECT * 
FROM table
WHERE col1 NOT IN (100,200)
ORDER BY col1 DESC
```

##### AND & BETWEEN

```
SELECT * 
FROM table
WHERE col1 NOT IN (100,150) AND col2 BETWEEN 200 AND 300
```

##### OR and IN being same

```
SELECT *
FROM table
WHERE col1 in (100,200)
```

```
SELECT * 
FROM table
WHERE col1 = 100 OR col1 = 200
```

### Joins

##### Inner Join

```
SELECT *
FROM table1
JOIN table2
ON table1.col1 = table2.col2
```

##### Join multiple tables

```
SELECT table1.col2, table2.col4, table3.col6
FROM table1
JOIN table2
on table1.col1 = tables2.col2
JOIN table3
on table2.col2 = table3.col3
```

```
SELECT t1.col2, t2.col4, t3.col6
FROM table1 t1
JOIN table2 t2
on t1.col1 = t2.col2
JOIN table3 t3
on t2.col2 = t3.col3
```

##### Left outer join an left join are same

```
SELCT t1.col1, t2.col2
FROM table1 t1
LEFT JOIN  table2 t2
ON t1.col1 = t2.col1
```

##### joining and filtering together: subsets it first (even before to where clause)

```
SELECT t1.c1, t2.c2
FROM table1 t1
JOIN table2 t2
on t1.c1 = t2.c1 and t1.c1 == 100
```

##### Union : generates unique rows

```
SELECT t1.c1
FROM table1 t1
UNION
SELECT t2.c1
FROM table2 t2
```

##### UNION ALL: generates duplicate rows as well

##### CROSS JOIN: when 2 atomic table grow on their own , there may be scenario we check the permutation of it. for e.g. rules and regularization to all the department.

```
SELECT *
FROM table1 t1
CROSS JOIN table2 t2
```

##### SELF JOIN

```
SELECT * 
FROM table1 t1, table1 t2
WHERE t1.city = t2.city and t1.id <> t2.id
```
##### To list all the id with same city. As a replacement to group by

### Aggregation

##### Nulls

```
SELECT *
FROM table1 t1
WHERE t1 IS NOT NULL
```

##### Count

```
SELECT COUNT(*) total_new_joiner
FROM table as t1
WHERE t1.id > 2000
```

##### COUNT(*) is not equal to COUNT(col1); if the column has NULL values

##### SUM

```
SELECT SUM(t1.marks) total_marks
FROM table as t1
WHERE t1.dep_id == 100
```
##### SUM will treat NULL as 0

##### Min & Max

```
SELECT MIN(c.population) low_population,
        MAX(c. population) high_population,
        c.continent_id

FROM continent as c        
```

##### AVG: ignores null values all together; nor in numerator or denominator

##### Median

```
SELECT count(*)
FROM table1

```
##### Note the value and divide by 2. Again note the devisor
```
SELECT *
FROM (SELECT col1 FROM table1 ORDER BY col1 LIMIT divisor) as table_new
order by col1 desc
LIMIT 2
```

##### GROUP BY

It lies between WHERE and ORDER BY and must be included if the SELECT statement includes columns which are NOT aggregated.

```
SELECT t1.c1, t1.c2, SUM(t1.c3) Total
FROM table1 t1
GROUP BY t1.c1, t1.c2
```

##### DISTINCT

```
SELECT DISTINCT c1 , c2
FROM table
```

DISTINCT removes the dependency of the aggregator function in select clause ; if only group by was the intent.

##### HAVING

```
SELECT COUNT(*) num_gt_5_cnt
FROM ( SELECT COUNT(*) gt_5
        FROM table_old to
        group by to.id
        having count(*) > 5
) as table1 t1
GROUP BY t1.gt_5

```
##### To print number of id > 5 sets

##### DATE_TRUNC

```
SELECT DATE_TRUNC('year', col_datetime), SUM(col2)
FROM table
GROUP BY 1
ORDER BY 2 DESC
```

DATE_PART : takes the portion of the date leaving rest .

##### CASE (equivalent to if condition in pgming)

```
SELECT CASE WHEN t1.c1 > 90 THEN 'A+'
            WHEN t1.c1 > 50 and t1.c1 < 90 THEN 'A'
            END as grades
FROM table1 t1
ORDER BY 1 
```

##### Subquery (nothing but one query output forms the table of another query)

###### To list the activities per day per channel
```
SELECT DATE_TRUNC('day',datetime_col) 'day', channel, count(*) num_of_events
FROM event_table
GROUP BY 2,1
```

##### To get the average activities per channel
```
SELECT channel, AVG(num_of_events)
FROM (SELECT DATE_TRUNC('day',datetime_col) 'day', channel, count(*) num_of_events
        FROM event_table
        GROUP BY 2,1) sub
GROUP By 1
ORDER BY 2
```